Ran Plan for project: `Production` dir: `infra/terraform/environment/prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.main.google_compute_global_forwarding_rule.forwarding_rule will be created
+ resource "google_compute_global_forwarding_rule" "forwarding_rule" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + id                    = (known after apply)
      + ip_address            = "35.186.250.114"
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "spino-forwarding-rule-prod"
      + network               = (known after apply)
      + port_range            = "443"
      + project               = "spino-cup-2024"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # module.main.google_compute_target_https_proxy.https_proxy will be created
+ resource "google_compute_target_https_proxy" "https_proxy" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "spino-https-proxy-prod"
      + project            = "spino-cup-2024"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = [
          + "https://www.googleapis.com/compute/v1/projects/spino-cup-2024/global/sslCertificates/spino-web-cert-prod",
        ]
      + tls_early_data     = (known after apply)
      + url_map            = (known after apply)
    }

  # module.main.google_compute_url_map.url_map will be created
+ resource "google_compute_url_map" "url_map" {
      + creation_timestamp = (known after apply)
      + default_service    = "https://www.googleapis.com/compute/v1/projects/spino-cup-2024/global/backendBuckets/spino-backend-bucket-prod"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "spino-url-map-prod"
      + project            = "spino-cup-2024"
      + self_link          = (known after apply)
    }

  # module.main.local_file.kubeconfig will be created
+ resource "local_file" "kubeconfig" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "spino-kubeconfig-prod"
      + id                   = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p Production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=tosaken1116%252Fspino_cup_2024%252Finfra%252Fterraform%252Fenvironment%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p Production
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```